Revit.Elements.LinkElement
A Revit Link Instance

Revit.Elements.LinkElement.GetLocation(Revit.Elements.Element)
Returns a linked element’s location
linkedElement: Element from a link instance
The linked element’s location

Revit.Elements.LinkElement.GetGeometry(Revit.Elements.Element,System.String)
Returns geometry from a linked element at the given detail level
linkedElement: Element from a link instance
detailLevel: Detail level
List of geometry from the linked element

Revit.Elements.LinkElement.LinkTransform(Revit.Elements.Element)
Returns the transform applied to the linked element
linkedElement:  Element from a link instance
Transform from the linked element

Revit.Elements.LinkElement.LinkInverseTransform(Revit.Elements.Element)
Returns the inverse vector of the transform applied to a linked element
linkedElement: Element from a link instance
Inverse vector applied to the linked element

Revit.Elements.LinkElement.BoundingBox(Revit.Elements.Element)
Returns a linked element’s BoundingBox
linkedElement: Element from a link instance
BoundingBox from the linked element

Revit.Elements.LinkElement.ByRayBounce(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Int32,Revit.Elements.Views.View3D)
Returns points and linked elements hit by ray bounce from the given origin point and direction
origin: Origin point of the ray
direction: Direction of the ray
maxBounces: Maximum number of bounces
view: 3D view from the Revit model
Positions hit by ray bounce
Linked elements hit by ray bounce

Revit.Elements.LinkElement.FindClosestReference(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.ReferenceWithContext})
Find the first intersection with a face
references:
Returns: